---
kind: other
id: Properties.T:Autodesk.Revit.UI.ExternalApplicationArrayIterator
source: html/28a1177a-3f80-e361-c67d-35c10197cb1c.htm
---
# ExternalApplicationArrayIterator Properties

Retrieves the item that is the current focus of the iterator.